In [15]:
a=0b123
print(a)

SyntaxError: invalid syntax (<ipython-input-15-ecf2d7b76af4>, line 1)

In [9]:
aa=10
aa=20
aa=31
print(aa)

31

In [16]:
bin(0o123)

'0b1010011'

In [18]:
a=10+5j
b=12+6j
c=a+b
print(c)
type(c)

(22+11j)

complex

In [ ]:
#https://home.openweathermap.org
#access key : 05c7f8b28705511925335e9de0c1ab9a
import json
import requests
city = "Bangalore,IN"
apikey = '3e95d94278ada3f6cb8152fed3b84f4f'

r = requests.get(f'http://api.openweathermap.org/data/2.5/weather?q={city}&appid={apikey}')
#print((r.content))

weather_report = json.loads(r.content)
print(round(weather_report['main']['temp']-273.12,2))
#print ((weather_report["main"]["temp"]))

In [1]:
import json
import requests
import time
i=0
a={}
city="Bangalore,IN"
apikey='3e95d94278ada3f6cb8152fed3b84f4f'
print("date , temperature, humidity, wind_speed, wind_direction")
while (i!=5):
    r=requests.get(f'http://api.openweathermap.org/data/2.5/weather?q={city}&appid={apikey}')
    weather_report=json.loads(r.content)
    a[i]={str((weather_report['dt'],round(weather_report['main']['temp']-237.12,2),weather_report['main']['humidity'],weather_report['wind']['speed'],weather_report['wind']['deg']))}
    with open("user5.txt", 'a')as fb:
        fb.writelines(a[i])
        print(a[i])
        fb.write("\n")
    i+=1
    time.sleep(120)

date , temperature, humidity, wind_speed, wind_direction
{'(1595849356, 64.19, 78, 1.5, 290)'}
{'(1595849356, 64.19, 78, 1.5, 290)'}
{'(1595849356, 64.19, 78, 1.5, 290)'}
{'(1595849356, 64.19, 78, 1.5, 290)'}
{'(1595849896, 64.19, 78, 1.5, 290)'}

In [1]:
print("helloworld")

helloworld

In [3]:
print("helloworld\nhelloworld")

helloworld
helloworld

In [4]:
bool(1)

True

In [5]:
bool1

NameError: name 'bool1' is not defined

In [6]:
int(bool(1))

1

In [7]:
bool("1")

True

In [9]:
type(True)

bool

In [24]:
Letters="ABCDEFGHIJK"
Letters=[0;;4]

SyntaxError: invalid syntax (<ipython-input-24-de17d6b3778c>, line 2)

In [32]:
n="uppercase"
print(n.upper())

TypeError: 'str' object is not callable

In [42]:
n="lizz"
n[0:2]

'li'

In [36]:
"0123456".find("1")

1

In [45]:
x="1"+"2"
print(x)

TypeError: 'str' object is not callable

In [46]:
x=1+2

In [47]:
sum(x)

TypeError: 'int' object is not iterable

In [48]:
x="jagan"+"moha"

In [49]:
print(x)

TypeError: 'str' object is not callable

In [16]:
a=("0","1","2","3")
a[:]

('0', '1', '2', '3')

In [13]:
m={"jaga","mohan","jagan"}
#m_set=set(m_list)

In [23]:
i="a"
if(i!="a"):  
    print("jid")
else:
    print("kjh")
print ("gbj")

kjh
gbj

In [27]:
A=[1,2,3]

for a in A:

    print(2*a)

2
4
6

In [18]:
def jagan mohan():
    pass
print(jagan mohan())

SyntaxError: invalid syntax (<ipython-input-18-ab17aa2535ea>, line 1)

In [21]:
def f(*x):
    return sum(x)

In [22]:
class circle (object):
    def __int__(self,radius,color):
        self.radius=radius;
        self.color=color;

In [28]:
m={"a":1,"b":2}

In [29]:
print(m)

{'a': 1, 'b': 2}

In [33]:
def Delta(x):

    if x==0:

        y=1;

    else:

        y=0;

    return(1)

In [ ]:
import pandas as pd 
dict={"a":[11,21,31],"b":{12,22,32}}
df=pd.DataFrame(dict_)
df.head()

In [43]:
import numpy as np
a=np.array([0,1,2,3,4])
type(a)
a.size
a.ndim
a.shape

(5,)

In [50]:
import numpy as np
a=np.array([1,1,1,1,1])

a+10

array([11, 11, 11, 11, 11])

In [51]:
a=3+2*2

In [52]:
print(a)

7

In [53]:
a=int(3.2)
print(a)

3

In [54]:
a="1234567"
a[1::2]

'246'

In [63]:
a="Michael Jackson"
a[5,6]

TypeError: string indices must be integers

In [64]:
a="1"
b="2"
a+b

'12'

In [67]:
A=((11,12),[21,22])
A[0][1]

12

In [68]:
a="1,2,3,4"
a.split(",")

['1', '2', '3', '4']

In [71]:
V={'A','B',"c"}
V.add("c")

In [72]:
for n in range(3):

print(n)

IndentationError: expected an indented block (<ipython-input-72-ad2b3d543313>, line 3)

In [74]:
A=['1','2','3']

for a in A:

    print(2*a)

11
22
33

In [78]:
def Add("1","1"):

z=1+1

return(1)

SyntaxError: invalid syntax (<ipython-input-78-fc4ed3e169b4>, line 1)

In [82]:
class Points(object):

    def __init__(self,x,y):

        self.x=x

        self.y=y

    def print_point(self):

         print('x=',self.x,' y=',self.y)

In [62]:
import pandas as pd
df = pd.read_csv (r'C:\Users\pc\KASHU EXCEL.csv')
df = df.drop(['Unnamed: 2','TOTAL'], axis=1)
df

   ID      NAMES   LAN1  LAN2  MATHS  SCIENCE   SOCIAL
0    1       AMAR    65    56     85        45      67
1    2      BHANU    98    45     78        89      65
2    3     CHERRY    87    58     47        78      98
3    4    DEEPIKA    68    69     48        55      98
4    5     GOPIKA    47    75     48        84      69
5    6    HEMANTH    75    59     48        78      87
6    7  ISHWARAYA    78    65     48        98      75
7    8   SAIKUMAR    69    58     47        58      69

In [63]:
col_list = ['LAN1', 'LAN2', 'MATHS', 'SCIENCE ', 'SOCIAL']

In [64]:
col_list

['LAN1', 'LAN2', 'MATHS', 'SCIENCE ', 'SOCIAL']

In [65]:
df['Total'] = df[col_list].sum(axis=1)

In [72]:
df = df.sort_values(by = ['Total'], ascending = False)

In [75]:
df.head(1)

   ID  NAMES   LAN1  LAN2  MATHS  SCIENCE   SOCIAL  Total
1    2  BHANU    98    45     78        89      65    375

In [71]:
df['Total'].nlargest(5)

1    375
2    368
6    364
5    347
3    338
Name: Total, dtype: int64

In [86]:
import pandas as pd
df = pd.read_csv (r'C:\Users\pc\KASHU EXCEL.csv')
df = df.drop(['Unnamed: 2',], axis=1)
print(df)
col_list = ['LAN1', 'LAN2', 'MATHS', 'SCIENCE ', 'SOCIAL']
df['Total'] = df[col_list].sum(axis=1)
df = df.sort_values(by = ['Total'], ascending = False)
df.head(5)
df.tail(5)

   ID      NAMES   LAN1  LAN2  MATHS  SCIENCE   SOCIAL  TOTAL
0    1       AMAR    65    56     85        45      67    318
1    2      BHANU    98    45     78        89      65    375
2    3     CHERRY    87    58     47        78      98    368
3    4    DEEPIKA    68    69     48        55      98    338
4    5     GOPIKA    47    75     48        84      69    323
5    6    HEMANTH    75    59     48        78      87    347
6    7  ISHWARAYA    78    65     48        98      75    364
7    8   SAIKUMAR    69    58     47        58      69    301

   ID     NAMES   LAN1  LAN2  MATHS  SCIENCE   SOCIAL  TOTAL  Total
5    6   HEMANTH    75    59     48        78      87    347    347
3    4   DEEPIKA    68    69     48        55      98    338    338
4    5    GOPIKA    47    75     48        84      69    323    323
0    1      AMAR    65    56     85        45      67    318    318
7    8  SAIKUMAR    69    58     47        58      69    301    301

In [80]:
import pandas as pd
df = pd.read_csv (r'C:\Users\pc\KASHU EXCEL.csv')
print (df)

   ID      NAMES   Unnamed: 2  LAN1  LAN2  MATHS  SCIENCE   SOCIAL  TOTAL
0    1       AMAR         NaN    65    56     85        45      67    318
1    2      BHANU         NaN    98    45     78        89      65    375
2    3     CHERRY         NaN    87    58     47        78      98    368
3    4    DEEPIKA         NaN    68    69     48        55      98    338
4    5     GOPIKA         NaN    47    75     48        84      69    323
5    6    HEMANTH         NaN    75    59     48        78      87    347
6    7  ISHWARAYA         NaN    78    65     48        98      75    364
7    8   SAIKUMAR         NaN    69    58     47        58      69    301

In [85]:
df = df.drop(['Unnamed: 2','TOTAL'], axis=1)

KeyError: "['Unnamed: 2'] not found in axis"

In [82]:
df

   ID      NAMES   LAN1  LAN2  MATHS  SCIENCE   SOCIAL  TOTAL
0    1       AMAR    65    56     85        45      67    318
1    2      BHANU    98    45     78        89      65    375
2    3     CHERRY    87    58     47        78      98    368
3    4    DEEPIKA    68    69     48        55      98    338
4    5     GOPIKA    47    75     48        84      69    323
5    6    HEMANTH    75    59     48        78      87    347
6    7  ISHWARAYA    78    65     48        98      75    364
7    8   SAIKUMAR    69    58     47        58      69    301

In [84]:
df = df.drop(['Unnamed: 2'],['TOTAL'], axis=1)

TypeError: drop() got multiple values for argument 'axis'

In [87]:
df

   ID      NAMES   LAN1  LAN2  MATHS  SCIENCE   SOCIAL  TOTAL  Total
1    2      BHANU    98    45     78        89      65    375    375
2    3     CHERRY    87    58     47        78      98    368    368
6    7  ISHWARAYA    78    65     48        98      75    364    364
5    6    HEMANTH    75    59     48        78      87    347    347
3    4    DEEPIKA    68    69     48        55      98    338    338
4    5     GOPIKA    47    75     48        84      69    323    323
0    1       AMAR    65    56     85        45      67    318    318
7    8   SAIKUMAR    69    58     47        58      69    301    301

In [90]:
df = df.sort_values(by = ['Total'], ascending = True)
df

   ID      NAMES   LAN1  LAN2  MATHS  SCIENCE   SOCIAL  TOTAL  Total
7    8   SAIKUMAR    69    58     47        58      69    301    301
0    1       AMAR    65    56     85        45      67    318    318
4    5     GOPIKA    47    75     48        84      69    323    323
3    4    DEEPIKA    68    69     48        55      98    338    338
5    6    HEMANTH    75    59     48        78      87    347    347
6    7  ISHWARAYA    78    65     48        98      75    364    364
2    3     CHERRY    87    58     47        78      98    368    368
1    2      BHANU    98    45     78        89      65    375    375

In [92]:
df.tail(3)

   ID      NAMES   LAN1  LAN2  MATHS  SCIENCE   SOCIAL  TOTAL  Total
6    7  ISHWARAYA    78    65     48        98      75    364    364
2    3     CHERRY    87    58     47        78      98    368    368
1    2      BHANU    98    45     78        89      65    375    375

In [93]:
df.head(3)

   ID     NAMES   LAN1  LAN2  MATHS  SCIENCE   SOCIAL  TOTAL  Total
7    8  SAIKUMAR    69    58     47        58      69    301    301
0    1      AMAR    65    56     85        45      67    318    318
4    5    GOPIKA    47    75     48        84      69    323    323

In [95]:
df = df.sort_values(by = ['MATHS'], ascending = False)
df

   ID      NAMES   LAN1  LAN2  MATHS  SCIENCE   SOCIAL  TOTAL  Total
0    1       AMAR    65    56     85        45      67    318    318
1    2      BHANU    98    45     78        89      65    375    375
4    5     GOPIKA    47    75     48        84      69    323    323
3    4    DEEPIKA    68    69     48        55      98    338    338
5    6    HEMANTH    75    59     48        78      87    347    347
6    7  ISHWARAYA    78    65     48        98      75    364    364
7    8   SAIKUMAR    69    58     47        58      69    301    301
2    3     CHERRY    87    58     47        78      98    368    368

NameError: name 'df' is not defined

In [18]:
import pandas as pd
df = pd.read_csv (r'C:\Users\pc\KASHU EXCEL.csv')
mean=df['Unnamed: 2'].mean()
df['Unnamed: 2'].replace(np.nan, mean)
print(df)

NameError: name 'np' is not defined

In [4]:
df["names"]

KeyError: 'names'

In [5]:
df['NAMES']

KeyError: 'NAMES'

In [16]:
print(df)

   ID      NAMES   LAN1  LAN2  MATHS  SCIENCE   SOCIAL  TOTAL
0    1       AMAR    65    56     85        45      67    318
1    2      BHANU    98    45     78        89      65    375
2    3     CHERRY    87    58     47        78      98    368
3    4    DEEPIKA    68    69     48        55      98    338
4    5     GOPIKA    47    75     48        84      69    323
5    6    HEMANTH    75    59     48        78      87    347
6    7  ISHWARAYA    78    65     48        98      75    364
7    8   SAIKUMAR    69    58     47        58      69    301

In [14]:
df.drop(['Unnamed: 2'],axis=1)

KeyError: "['Unnamed: 2'] not found in axis"

In [15]:
df

   ID      NAMES   LAN1  LAN2  MATHS  SCIENCE   SOCIAL  TOTAL
0    1       AMAR    65    56     85        45      67    318
1    2      BHANU    98    45     78        89      65    375
2    3     CHERRY    87    58     47        78      98    368
3    4    DEEPIKA    68    69     48        55      98    338
4    5     GOPIKA    47    75     48        84      69    323
5    6    HEMANTH    75    59     48        78      87    347
6    7  ISHWARAYA    78    65     48        98      75    364
7    8   SAIKUMAR    69    58     47        58      69    301

In [19]:
print(df)

   ID      NAMES   Unnamed: 2  LAN1  LAN2  MATHS  SCIENCE   SOCIAL  TOTAL
0    1       AMAR         NaN    65    56     85        45      67    318
1    2      BHANU         NaN    98    45     78        89      65    375
2    3     CHERRY         NaN    87    58     47        78      98    368
3    4    DEEPIKA         NaN    68    69     48        55      98    338
4    5     GOPIKA         NaN    47    75     48        84      69    323
5    6    HEMANTH         NaN    75    59     48        78      87    347
6    7  ISHWARAYA         NaN    78    65     48        98      75    364
7    8   SAIKUMAR         NaN    69    58     47        58      69    301

In [27]:
df.dtypes

ID              int64
NAMES          object
Unnamed: 2    float64
LAN1            int64
LAN2            int64
MATHS           int64
SCIENCE         int64
SOCIAL          int64
TOTAL           int64
dtype: object

In [28]:
df['LAN1']/df['LAN1'] .max()

0    0.663265
1    1.000000
2    0.887755
3    0.693878
4    0.479592
5    0.765306
6    0.795918
7    0.704082
Name: LAN1, dtype: float64

In [29]:
df['LAN1']=(df['LAN1']-df['LAN1'].min())/(df['LAN1'].max()-df['LAN1'].min())

In [30]:
df("LAN1")

TypeError: 'DataFrame' object is not callable

In [33]:
df=pd.get_dummies(df,columns=["NAMES"])

KeyError: "None of [Index(['NAMES'], dtype='object')] are in the [columns]"

In [34]:
df = pd.get_dummies(df, columns=["NAMES"])

KeyError: "None of [Index(['NAMES'], dtype='object')] are in the [columns]"

In [37]:
df['NA'].std()

KeyError: 'NAMES'

In [4]:
import pandas as pd
df = pd.read_csv (r'C:\Users\pc\KASHU EXCEL.csv')
print(df)

   ID      NAMES   Unnamed: 2  LAN1  LAN2  MATHS  SCIENCE   SOCIAL  TOTAL
0    1       AMAR         NaN    65    56     85        45      67    318
1    2      BHANU         NaN    98    45     78        89      65    375
2    3     CHERRY         NaN    87    58     47        78      98    368
3    4    DEEPIKA         NaN    68    69     48        55      98    338
4    5     GOPIKA         NaN    47    75     48        84      69    323
5    6    HEMANTH         NaN    75    59     48        78      87    347
6    7  ISHWARAYA         NaN    78    65     48        98      75    364
7    8   SAIKUMAR         NaN    69    58     47        58      69    301

In [5]:
df.describe()

,ID,Unnamed: 2,LAN1,LAN2,MATHS,SCIENCE,SOCIAL,TOTAL
count,8.00000,0.0,8.000000,8.0000,8.000000,8.000000,8.000000,8.000000
mean,4.50000,NaN,73.375000,60.6250,56.125000,73.125000,78.500000,341.750000
std,2.44949,NaN,15.259072,9.0859,15.779168,18.457964,13.835771,26.477753
min,1.00000,NaN,47.000000,45.0000,47.000000,45.000000,65.000000,301.000000
25%,2.75000,NaN,67.250000,57.5000,47.750000,57.250000,68.500000,321.750000
50%,4.50000,NaN,72.000000,58.5000,48.000000,78.000000,72.000000,342.500000
75%,6.25000,NaN,80.250000,66.0000,55.500000,85.250000,89.750000,365.000000
max,8.00000,NaN,98.000000,75.0000,85.000000,98.000000,98.000000,375.000000

In [6]:
import pandas as pd
df = pd.read_csv (r'C:\Users\pc\KASHU EXCEL.csv')
print(df)

   ID      NAMES   Unnamed: 2  LAN1  LAN2  MATHS  SCIENCE   SOCIAL  TOTAL
0    1       AMAR         NaN    65    56     85        45      67    318
1    2      BHANU         NaN    98    45     78        89      65    375
2    3     CHERRY         NaN    87    58     47        78      98    368
3    4    DEEPIKA         NaN    68    69     48        55      98    338
4    5     GOPIKA         NaN    47    75     48        84      69    323
5    6    HEMANTH         NaN    75    59     48        78      87    347
6    7  ISHWARAYA         NaN    78    65     48        98      75    364
7    8   SAIKUMAR         NaN    69    58     47        58      69    301

In [9]:
df.describe()

,ID,Unnamed: 2,LAN1,LAN2,MATHS,SCIENCE,SOCIAL,TOTAL
count,8.00000,0.0,8.000000,8.0000,8.000000,8.000000,8.000000,8.000000
mean,4.50000,NaN,73.375000,60.6250,56.125000,73.125000,78.500000,341.750000
std,2.44949,NaN,15.259072,9.0859,15.779168,18.457964,13.835771,26.477753
min,1.00000,NaN,47.000000,45.0000,47.000000,45.000000,65.000000,301.000000
25%,2.75000,NaN,67.250000,57.5000,47.750000,57.250000,68.500000,321.750000
50%,4.50000,NaN,72.000000,58.5000,48.000000,78.000000,72.000000,342.500000
75%,6.25000,NaN,80.250000,66.0000,55.500000,85.250000,89.750000,365.000000
max,8.00000,NaN,98.000000,75.0000,85.000000,98.000000,98.000000,375.000000

In [11]:
import pandas as pd
df = pd.read_csv (r'C:\Users\pc\KASHU EXCEL.csv')
df_test=[['MATHS','SCIENCE']]
print(df)

   ID      NAMES   Unnamed: 2  LAN1  LAN2  MATHS  SCIENCE   SOCIAL  TOTAL
0    1       AMAR         NaN    65    56     85        45      67    318
1    2      BHANU         NaN    98    45     78        89      65    375
2    3     CHERRY         NaN    87    58     47        78      98    368
3    4    DEEPIKA         NaN    68    69     48        55      98    338
4    5     GOPIKA         NaN    47    75     48        84      69    323
5    6    HEMANTH         NaN    75    59     48        78      87    347
6    7  ISHWARAYA         NaN    78    65     48        98      75    364
7    8   SAIKUMAR         NaN    69    58     47        58      69    301

In [14]:
df_test=[['MATHS','SCIENCE']]
df_group=df_test.group(['MATHS','SCIENCE'], as_index=False).mean()
df_grp

AttributeError: 'list' object has no attribute 'group'

In [15]:
df

   ID      NAMES   Unnamed: 2  LAN1  LAN2  MATHS  SCIENCE   SOCIAL  TOTAL
0    1       AMAR         NaN    65    56     85        45      67    318
1    2      BHANU         NaN    98    45     78        89      65    375
2    3     CHERRY         NaN    87    58     47        78      98    368
3    4    DEEPIKA         NaN    68    69     48        55      98    338
4    5     GOPIKA         NaN    47    75     48        84      69    323
5    6    HEMANTH         NaN    75    59     48        78      87    347
6    7  ISHWARAYA         NaN    78    65     48        98      75    364
7    8   SAIKUMAR         NaN    69    58     47        58      69    301

In [ ]:
import seaborn as sns
import pandas as pd
import numpy as np
df = pd.read_csv (r'C:\Users\pc\KASHU EXCEL.csv')
print(df)

In [17]:
df

   ID      NAMES   Unnamed: 2  LAN1  LAN2  MATHS  SCIENCE   SOCIAL  TOTAL
0    1       AMAR         NaN    65    56     85        45      67    318
1    2      BHANU         NaN    98    45     78        89      65    375
2    3     CHERRY         NaN    87    58     47        78      98    368
3    4    DEEPIKA         NaN    68    69     48        55      98    338
4    5     GOPIKA         NaN    47    75     48        84      69    323
5    6    HEMANTH         NaN    75    59     48        78      87    347
6    7  ISHWARAYA         NaN    78    65     48        98      75    364
7    8   SAIKUMAR         NaN    69    58     47        58      69    301

In [20]:
sns.scatterplot(x="SCIENCE", y="SOCIAL", axis=1)

ValueError: Could not interpret input 'SCIENCE'

In [1]:
import pandas as pd
df = pd.read_csv (r'C:\Users\pc\KASHU EXCEL.csv')
print (df)

   ID      NAMES   Unnamed: 2  LAN1  LAN2  MATHS  SCIENCE   SOCIAL  TOTAL
0    1       AMAR         NaN    65    56     85        45      67    318
1    2      BHANU         NaN    98    45     78        89      65    375
2    3     CHERRY         NaN    87    58     47        78      98    368
3    4    DEEPIKA         NaN    68    69     48        55      98    338
4    5     GOPIKA         NaN    47    75     48        84      69    323
5    6    HEMANTH         NaN    75    59     48        78      87    347
6    7  ISHWARAYA         NaN    78    65     48        98      75    364
7    8   SAIKUMAR         NaN    69    58     47        58      69    301

In [2]:
import numpy as np  # useful for many scientific computing in Python
import pandas as pd # primary data structure library
df_can = pd.read_csv (r'C:\Users\pc\KASHU EXCEL.csv')
df_can.head()

   ID    NAMES   Unnamed: 2  LAN1  LAN2  MATHS  SCIENCE   SOCIAL  TOTAL
0    1     AMAR         NaN    65    56     85        45      67    318
1    2    BHANU         NaN    98    45     78        89      65    375
2    3   CHERRY         NaN    87    58     47        78      98    368
3    4  DEEPIKA         NaN    68    69     48        55      98    338
4    5   GOPIKA         NaN    47    75     48        84      69    323

In [3]:
print(df_can.shape)

(8, 9)

In [4]:
df_can.drop(['Unnamed: 2'], axis=1, inplace=True)
df_can.head()

   ID    NAMES   LAN1  LAN2  MATHS  SCIENCE   SOCIAL  TOTAL
0    1     AMAR    65    56     85        45      67    318
1    2    BHANU    98    45     78        89      65    375
2    3   CHERRY    87    58     47        78      98    368
3    4  DEEPIKA    68    69     48        55      98    338
4    5   GOPIKA    47    75     48        84      69    323

In [10]:
df_can.rename(columns={'teluguName':'LAN1'}, inplace=True)
df_can.head()

   ID    NAMES   LAN1  LAN2  MATHS  SCIENCE   SOCIAL  TOTAL
0    1     AMAR    65    56     85        45      67    318
1    2    BHANU    98    45     78        89      65    375
2    3   CHERRY    87    58     47        78      98    368
3    4  DEEPIKA    68    69     48        55      98    338
4    5   GOPIKA    47    75     48        84      69    323

In [6]:
df_can.head()

   ID    NAMES   LAN1  LAN2  MATHS  SCIENCE   SOCIAL  TOTAL
0    1     AMAR    65    56     85        45      67    318
1    2    BHANU    98    45     78        89      65    375
2    3   CHERRY    87    58     47        78      98    368
3    4  DEEPIKA    68    69     48        55      98    338
4    5   GOPIKA    47    75     48        84      69    323

In [11]:
all(isinstance(column, str) for column in df_can.columns)

True

In [12]:
df_can.set_index('LAN1', inplace=True)
df_can.head()

      ID    NAMES   LAN2  MATHS  SCIENCE   SOCIAL  TOTAL
LAN1
65      1     AMAR    56     85        45      67    318
98      2    BHANU    45     78        89      65    375
87      3   CHERRY    58     47        78      98    368
68      4  DEEPIKA    69     48        55      98    338
47      5   GOPIKA    75     48        84      69    323

In [13]:
df_can['Total'] = df_can.sum(axis=1)
df_can.head()

      ID    NAMES   LAN2  MATHS  SCIENCE   SOCIAL  TOTAL  Total
LAN1
65      1     AMAR    56     85        45      67    318    572
98      2    BHANU    45     78        89      65    375    654
87      3   CHERRY    58     47        78      98    368    652
68      4  DEEPIKA    69     48        55      98    338    612
47      5   GOPIKA    75     48        84      69    323    604

In [14]:
# use the inline backend to generate the plots within the browser
%matplotlib inline 

import matplotlib as mpl
import matplotlib.pyplot as plt

mpl.style.use('ggplot') # optional: for ggplot-like style

# check for latest version of Matplotlib
print ('Matplotlib version: ', mpl.__version__) # >= 2.0.0

Matplotlib version:  3.0.3

In [19]:
df_can.sort_values(['Total'], ascending=False, axis=0, inplace=True)

# get the top 5 entries
df_top5 = df_can.head()

# transpose the dataframe
#df_top5 = df_top5[LAN1].transpose() 

#df_top5.head()

In [ ]:
df_top5.index = df_top5.index.map(int) # let's change the index values of df_top5 to type integer for plotting
df_top5.plot(kind='', 
             stacked=False,
             figsize=(8, 9), # pass a tuple (x, y) size
             )

plt.title('Immigration Trend of Top 5 Countries')
plt.ylabel('Number of Immigrants')
plt.xlabel('Years')

plt.show()